Revit 2026 API

# CeramicCeramicColorByObject Property

---

The property labeled "Color" from the "Ceramic" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string CeramicColorByObject { get; }
```
```vb
Public Shared ReadOnly Property CeramicColorByObject As String
	Get
```
```cpp
public:
static property String^ CeramicColorByObject {
	String^ get ();
}
```
```fsharp
static member CeramicColorByObject : string with get
```

#### Property Value

String

This property is of type "AssetPropertyBoolean".

#### Reference

Ceramic Class

Autodesk.Revit.DB.Visual Namespace